==================
Liquid Tag with If
==================

<html>
  {% liquid
    include "file"
    assign product_type = product.type | downcase

    if product_type != blank
      product_type | trim
      echo product_type
    else
      assign product_type = "type"
    endif
  %}
</html>

---
  (template
   (content)
   (directive
    (liquid_tag
     (include
      (string))
     (assignment
      variable_name: (identifier)
      value: (filter
        body: (access
          receiver: (identifier)
          property: (identifier))
        name: (identifier)))
     (if_liq
      condition: (predicate
        left: (identifier)
        right: (identifier))
      consequence: (block
        (filter
         body: (identifier)
         name: (identifier))
        (echo
         (identifier)))
      alternative: (else_liq
        (block
         (assignment
          variable_name: (identifier)
          value: (string)))))))
(content))

==================
Liquid Tag with Case
==================

<html>
  {% liquid

    assign product_type = product.type | downcase
    assign message = ''

    case product_type
      when 'health'
        assign message = 'This is a health potion!'
        echo message | trim
      when 'love'
        assign message = 'This is a love potion!'
      else
        render "page"
        product_type | json
    endcase

    echo message
  %}
</html>

---
  (template
   (content)
   (directive
    (liquid_tag
     (assignment
      variable_name: (identifier)
      value: (filter
        body: (access
          receiver: (identifier)
          property: (identifier))
        name: (identifier)))
     (assignment
      variable_name: (identifier)
      value: (string))
     (case_liq
      receiver: (identifier)
      conditions: (block
        (when_liq
         condition: (argument_list 
           (string))
         consequence: (block
           (assignment
            variable_name: (identifier)
            value: (string))
           (echo
            (filter
             body: (identifier)
             name: (identifier)))))
        (when_liq
         condition: (argument_list 
           (string))
         consequence: (block
           (assignment
            variable_name: (identifier)
            value: (string)))))
      alternative: (else_liq
        (block
         (render
          file: (string))
         (filter
          body: (identifier)
          name: (identifier)))))
  (echo
   (identifier))))
(content))

==================
Liquid Tag with For Loop
==================

<html>
  {% liquid
    for product_type in product.types
      assign data = product_type
      cycle "group": "one", string, access.string
      echo data
      break
    endfor
  %}
</html>

---
  (template
   (content)
   (directive
    (liquid_tag
     (for_loop_liq
      item: (identifier)
      iterator: (access
        receiver: (identifier)
        property: (identifier))
      body: (block
        (assignment
         variable_name: (identifier)
         value: (identifier))
        (cycle
         group_name: (string)
         group_item: (string)
         group_item: (identifier)
         group_item: (access
           receiver: (identifier)
           property: (identifier)))
        (echo
         (identifier))
        (break)))))
(content))

==================
Liquid Tag with Capture
==================

<html>
  {% liquid
    capture title
      if show_up_title
         up_title
      else
        down_title
      endif
    endcapture
  %}
</html>

---
(template
 (content)
 (directive
  (liquid_tag
   (capture_liq
    variable: (identifier)
    value: (block
       (if_liq
        condition: (identifier)
        consequence: (block
            (identifier))
        alternative: (else_liq
          (block
             (identifier))))))))
  (content))

==================
Liquid Tag with Tablerow
==================

<html>
  {% liquid
    tablerow product_type in product.types
      assign data = product_type
      echo data
    endtablerow
  %}
</html>

---
  (template
   (content)
   (directive
    (liquid_tag
     (tablerow_liq
      item: (identifier)
      iterator: (access
        receiver: (identifier)
        property: (identifier))
      body: (block
        (assignment
         variable_name: (identifier)
         value: (identifier))
        (echo
         (identifier))))))
   (content))

==================
Liquid Tag with Form
==================

<html>
  {% liquid
    form "type"
      echo "content"
    endform
  %}
</html>

---
  (template
   (content)
   (directive
    (liquid_tag
     (form_liq
      (string)
      (echo
       (string)))))
   (content))

==================
Liquid Tag with Paginate
==================

<html>
  {% liquid
    paginate collection.products by 3, window_size: 1 
      echo "content"
    endpaginate
  %}
</html>

---
  (template
   (content)
   (directive
    (liquid_tag
     (paginate_liq
      (access
       (identifier)
       (identifier))
      (number)
      (argument_list
       (argument
        (identifier)
        (number)))
      (block
       (echo
        (string))))))
   (content))
