==================
Literal
==================

<html>
  {{ 'string' }}
</html>

---
(template
 (content)
 (program
  (expression
   (string)))
 (content))

==================
Filter
==================

<html>
  {{ 'string two' | split: " " }}
</html>

---
(template
 (content)
 (program
  (filter
   body: (expression (string))
   name: (identifier)
   (argument_list (string))))
 (content))

==================
Filter w/ variable
==================

<html>
  {% assign space = " " %}
  <div>{{ 'string two' | split: space }}</div>
</html>

---

(template
 (content)
 (program
  (statement
   (assignment
    variable_name: (identifier)
    value: (expression (string)))))
 (content)
 (program
  (filter
   body: (expression (string))
   name: (identifier)
   (argument_list (identifier))))
 (content))

==================
Many filters
==================

<html>
  {{ 'string two' | split: space | first }}
</html>

---
(template
 (content)
 (program
  (filter
   body:
   (filter
    body: (expression (string))
    name: (identifier)
    (argument_list (identifier)))
   name: (identifier)))
 (content))

==================
Filters with many arguments
==================

<html>
  {% assign kitchen_products = products | where: "type", "kitchen" %}
</html>

---
(template
 (content)
 (program
  (statement
   (assignment
    variable_name: (identifier)
    value:
    (filter
     body: (expression (identifier))
     name: (identifier)
     (argument_list (string) (string))))))
 (content))

==================
Filters argument hash
==================

<html>
  {{ display_price | default: true, allow_false: true }}
</html>

---
(template
 (content)
 (program
  (filter
   body: (expression (identifier))
   name: (identifier)
   (argument_list
    (boolean)
    (argument key: (identifier) value: (boolean)))))
 (content))

==================
Filters precedence
==================

<html>
  {{ "Ground control to Major Tom." | split: "" | reverse | join: "" }}
</html>

---
(template
 (content)
 (program
  (filter
   body:
   (filter
    body:
    (filter
     body: (expression (string))
     name: (identifier)
     (argument_list (string)))
    name: (identifier))
   name: (identifier)
   (argument_list (string))))
 (content))

==================
Method Call
==================

<html>
  {{ page.title }}
</html>

---
(template
 (content)
 (program
  (expression
   (call
    receiver: (identifier)
    method: (identifier))))
 (content))

==================
Compound Method Call With Filter
==================

<html>
  {{ data.page.title | reverse}}
</html>

---
(template
 (content)
 (program
  (filter
   body:
   (expression
    (call
     receiver:
     (call
      receiver: (identifier)
      method: (identifier))
     method: (identifier)))
   name: (identifier)))
 (content))
